# Pandas Select Rows by Index position

for detailed explanation of this examples refer to [pandas iloc[]](https://sparkbyexamples.com/pandas/pandas-iloc-usage-with-examples)

In [3]:
import pandas as pd
import numpy as np
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas","Oracle","Java"],
    'Fee' :[20000,25000,26000,22000,24000,21000,22000],
    'Duration':['30days','40days','35days','40days',np.nan,None,'55days'],
    'Discount':[1000,2300,1500,1200,2500,2100,2000]
               }
index_labels=['r1','r2','r3','r4','r5','r6','r7']
df = pd.DataFrame(technologies,index=index_labels)
df

    Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   pandas  24000      NaN      2500
r6   Oracle  21000     None      2100
r7     Java  22000   55days      2000

In [4]:
# Select Row by Integer Index
df1=(df.iloc[2])
df1

Courses     Hadoop
Fee          26000
Duration    35days
Discount      1500
Name: r3, dtype: object

In [5]:
# Select Rows by Index List
df1=(df.iloc[[2,3,6]])
df1

   Courses    Fee Duration  Discount
r3  Hadoop  26000   35days      1500
r4  Python  22000   40days      1200
r7    Java  22000   55days      2000

In [6]:
# Select Rows by Integer Index Range
df1=(df.iloc[1:5])
df1

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   pandas  24000      NaN      2500

In [7]:
# Select First Row by Index
df1=(df.iloc[:1])
df1

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000

In [8]:
# Select First 3 Rows
df1=(df.iloc[:3])
df1

    Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500

In [9]:
# Select Last Row by Index
df1=(df.iloc[-1:])
df1

   Courses    Fee Duration  Discount
r7    Java  22000   55days      2000

In [10]:
# Select Last 3 Row
df1=(df.iloc[-3:])
df1

   Courses    Fee Duration  Discount
r5  pandas  24000      NaN      2500
r6  Oracle  21000     None      2100
r7    Java  22000   55days      2000

In [11]:
# Selects alternate rows
df1=(df.iloc[::2])
df1

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000
r3  Hadoop  26000   35days      1500
r5  pandas  24000      NaN      2500
r7    Java  22000   55days      2000